/**********************************************************************

 backwardアルゴリズム

  HMMモデルλが与えられたとき観測系列Oの確率P(O|λ)を計算する。


**********************************************************************/
/*---------------------------------------------------------------------

 backward

---------------------------------------------------------------------*/
double backward(unsigned int N,          /* HMMの状態数              */
	        unsigned int M,          /* 出力シンボル種類数       */
	        unsigned int T,          /* 観測シンボル長           */ 
		int *O,                  /* 観測記号列 [T]           */
		double **a,              /* HMM状態遷移確率 [N*N]    */
		double **b,              /* HMMシンボル出力確率 [N*M]*/
		double *pi,              /* HMM初期状態確率 [N]      */
		double **beta            /* backward変数β[[T*N]      */
		)
{
  int i,j;                               /* 状態index                 */
  int t;                                 /* 時間index                 */
  double prob;                           /* backward確率              */


  /*------------------------------------
    初期化
  ------------------------------------*/
  t = T-1;
  for(i=0; i<=N-1; i++) {
    beta[t][i] = 1;
  }
    
  /*------------------------------------
    再帰計算
  ------------------------------------*/
  for(t=T-2; t>=0; t--) {
    for(i=0; i<N; i++) {
      beta[t][i] = 0;
      for(j=0; j<N; j++) {
	beta[t][i] += /* fill in blank */;
      }
    }
  }

  /*------------------------------------
    backward確率の計算
  ------------------------------------*/
  prob = 0.0;
  /* fill in blank */

  return prob;
}
