/**********************************************************************

 forwardアルゴリズム

  HMMモデルλが与えられたとき観測系列Oの確率P(O|λ)を計算する。

**********************************************************************/
/*---------------------------------------------------------------------

 forward

----------------------------------------------------------------------*/
double forward(unsigned int N,           /* HMMの状態数               */
	       unsigned int M,           /* 出力シンボル種類数        */
	       unsigned int T,           /* 観測シンボル長            */ 
	       int *O,                   /* 観測記号列 [T]            */
	       double **a,               /* HMM状態遷移確率 [N*N]     */
	       double **b,               /* HMMシンボル出力確率 [N*M] */
	       double *pi,               /* HMM初期状態確率 [N]       */
	       double **alpha            /* forward変数α [T*N]        */
	       )
{
  int i,j;                               /* 状態index                 */
  int t;                                 /* 時間index                 */
  double sum;                            /* 積和計算用変数            */
  double prob;                           /* forward確率               */
 

  /*------------------------------------
   初期化
  ------------------------------------*/
  t = 0;
  for(i=0; i<N; i++) {
    alpha[t][i] = pi[i] * b[i][O[0]]/* fill in blank */;
  }
    
  /*------------------------------------
   再帰計算
  ------------------------------------*/
  for(t=0; t<T-1; t++) {
    for(j=0; j<N; j++) {
      sum = 0;
      for(i=0; i<N; i++) {
	sum += alpha[t][i] * a[i][j]/* fill in blank */; 
      }
      alpha[t+1][j] = sum * b[j][O[t+1]]/* fill in blank */;
    }
  }

  /*------------------------------------
    forward確率の計算
  ------------------------------------*/
  prob = 0.0;
  /* fill in blank */
  for(i=0; i<N; i++) {
    prob += alpha[T-1][i];
  }

  return prob;
}
