/**********************************************************************

  gpdf.c: 多次元ガウス確率密度関数

***********************************************************************/
/*---------------------------------------------------------------------

 include files

---------------------------------------------------------------------*/
#include <stdio.h>
#include <math.h>
#include <stdlib.h>



/*----------------------------------------------------------------------

 gaussian probability function

----------------------------------------------------------------------*/
double gpdf(int D,          /* 観測ベクトルo(t)の次数  */
	    float *o,       /* 観測ベクトル o(t)      */
	    float *mu,      /* 平均値ベクトル         */
	    float *sigma2)  /* 対角共分散ベクトル      */ 
{
  int d;                    /* 式(5.35)のd（次元)            */
  double diff;              /* 式(5.35)の分子の引算の値 */
  double sum;               /* 式(5.35)のΣ（和）を計算する変数 */
  double prod;              /* 式(5.35)のΠ（積）を計算する変数 */
  double result;            /* 式(5.35)の左辺の値（確率密度）  */

  
  sum = 0.0 ;
  prod = 1.0 ;
  for(d=0; d<D; d++) {
    /* fill in blank */;
  }

  /* fill in blank */;
  result = exp(sum)/prod;

  return (result);
}
